#+TITLE: Linux Config
#+TAGS: full(f) essential(e) crypt(c)
#+PROPERTY: header-args :mkdirp yes :tangle (my-tangle-if-property-in-tags "conftype")
#+conftype: full
#+STARTUP: overview

My linux configuration files tangled from a single org file. How spunky.

The goal is to just track a single org file for all my configurations. Even for
different systems.
** conditional tangling
:PROPERTIES:
:TANGLE_FILE_NAME: ./test.conf
:END:

Define a function that disables export of a code block if the conftype property
does not match a certain  value. the idea is that the ~conftype~ property is set
at top level (after pulling to a new device) and it is then respected by the
tangle process.
#+name:check-conftype
#+BEGIN_SRC emacs-lisp :tangle no
(defun my-tangle-if-property-in-tags (property-name)
  "Create :tangle argument based on a local property value.
Check if the conftype property matches a tag at the current postition.
The tags are searched recursively, so it's recommended to tag
the last subheading level. If it matches return the property
 value of the TANGLE_FILE_NAME or ('yes' by default)
if not return 'no'."
  (if (member (+org-get-global-property property-name) (org-get-tags))
        (let ((positive-return (org-entry-get nil "TANGLE_FILE_NAME" t)))
             (if positive-return positive-return "yes"))
    "no")
  )
#+END_SRC

#+RESULTS: check-conftype
: my-tangle-if-property-in-tags

#+BEGIN_SRC emacs-lisp
(my-tangle-if-property-in-tags "conftype")
#+END_SRC

#+RESULTS:
: ./test.conf

#+BEGIN_SRC emacs-lisp 
(my-is-conftype "halg")
#+END_SRC

#+RESULTS:
: no

#+begin_src conf :tangle (my-is-conftype "full") 
it works
#+end_src

#+begin_src conf :tangle (my-is-conftype "half") 
it does not work
#+end_src

